EDT/УТ/src/Documents/ВосстановлениеНеНайденныхПозиций/ВосстановлениеНеНайденныхПозиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВосстановлениеНеНайденныхПозиций</name>
  <tabularSections>
    <name>Доставки</name>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>BusinessProcessRef.новаМестнаяДоставка</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДоставкиСОтклонениямиКоличестваСписком</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.НДСНачисленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРознице</registerRecords>
  <registerRecords>AccumulationRegister.ВнутренниеЗаказы</registerRecords>
  <registerRecords>InformationRegister.АдресноеХранениеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.НДСВключенныйВСтоимость</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПеремещениюВНТТ</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.НДСПартииТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезервеНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНТТ</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПолучениюНаСклады</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПередачеСоСкладов</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСвСтоимостиТоваров</name>
    <comment>Необходимые действия по включению или исключению НДС в стоимости товаров при перемещении</comment>
    <type>
      <types>EnumRef.ДействиеНДСВСтоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ) Розничная цена в розничной торговле</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСпособСписанияОстаткаТоваров</name>
      <comment>(Упр)</comment>
      <type>
        <types>EnumRef.СпособыСписанияОстаткаТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийЗаказ</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратнаяТара</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСпособСписанияОстаткаТоваров</name>
      <comment>(Упр)</comment>
      <type>
        <types>EnumRef.СпособыСписанияОстаткаТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийЗаказ</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ВосстановлениеНеНайденныхПозиций/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Соединение = Евген.СоздатьПодключениеКИнтернетМагазину();
	Для Каждого Тек Из Доставки Цикл
		ИсправитьДоставку(Соединение, Тек, Ложь);
	КонецЦикла;	
КонецПроцедуры



Процедура ИсправитьДоставку(Соединение, Тек_, Режим);
	Если Режим Тогда
		Струк = Новый Структура;
		Струк.Вставить("Доставка", Тек_.Доставка);
		НайСтр = Тек_.Документ.Товары.НайтиСтроки(Струк);
		Кол1 = 0;
		Кол2 = 0;
		
		Для Каждого Стр Из НайСтр Цикл
			Кол1 = Кол1 + Стр.Количество;
			Кол2 = Кол2 + Стр.НеобходимоеКоличество;
		КонецЦикла;	
		Если Кол1 = Кол2 Тогда
			Возврат;
		КонецеСли;	
		Дост = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Тек_.Доставка.Номер);
		Для Каждого Тек Из НайСтр Цикл
			Кол = Тек.НеобходимоеКоличество - Тек.Количество;
			Если Кол = 0 Тогда
				Продолжить;
			КонецеСли;	
			КодТовара = Число(Тек.Номенклатура.Код);
			
			
			евген.ЗапросКИнтернетМагазину("DECLARE @t TMissedCount
			|INSERT INTO @t ([skuid],[MissedCount]) VALUES (" + Формат(КодТовара, "ЧГ=") + ", " + Формат(Кол, "ЧН=0; ЧГ=") + ")" + "
			|EXEC sp_setMissedCount " + Формат(Число(Тек.Доставка.Номер), "ЧГ=") + ", @t, 0", Соединение);
			
			
			//Д = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Тек.Доставка.Номер);
			//ОбД = Д.ПолучитьОбъект();
			//Если Тек.Сумма <> 0 Тогда
			//	Най = ОбД.Товары.Найти(Тек.Номенклатура);
			//	Если Най <> Неопределено Тогда
			//		Если Тек.Количество <= 0 Тогда
			//			ОбД.Товары.Удалить(Най);
			//		Иначе
			//			Най.Количество = Тек.Количество;
			//			Най.Сумма = Най.Количество * Най.Цена;
			//			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Най, ОбД);
			//		КонецеСли;	
			//		
			//		ОбД.Записать(РежимЗаписиДокумента.Запись);
			//		Если ОбД.Проведен Тогда
			//			ОбД.Записать(РежимЗаписиДокумента.Проведение);
			//		конецеСли;	
			//	КонецеСли;
			//Иначе
			//	Най = ОбД.ПодарочныеПозиции.Найти(Тек.Номенклатура);
			//	Если Най <> Неопределено Тогда
			//		Если Тек.Количество <= 0 Тогда
			//			ОбД.ПодарочныеПозиции.Удалить(Най);
			//		Иначе
			//			Най.Количество = Тек.Количество;
			//			Най.Сумма = Най.Количество * Най.Цена;
			//		КонецеСли;	
			//		
			//		ОбД.Записать(РежимЗаписиДокумента.Запись);
			//		Если ОбД.Проведен Тогда
			//			ОбД.Записать(РежимЗаписиДокумента.Проведение);
			//		конецеСли;	
			//	КонецеСли;
			//КонецеСли;
			
			//Д = Документы.ПеремещениеТоваров.НайтиПоНомеру(Тек.Доставка.Номер);
			//
			//ОбД = Д.ПолучитьОбъект();
			//Струк = Новый Структура;
			//Струк.Вставить("Номенклатура", тек.Номенклатура);
			//Струк.Вставить("Количество", тек.НеобходимоеКоличество);
			//
			//Най = ОбД.Товары.НайтиСтроки(Струк);
			//Если Най.Количество() <> 0 Тогда
			//	Най_ = Най[0];
			//	Если Най_ <> Неопределено Тогда
			//		Если Тек.Количество = 0 Тогда
			//			ОбД.Товары.Удалить(Най_);
			//		Иначе
			//			Най_.Количество = Тек.Количество;
			//		КонецеСли;	
			//		
			//		ОбД.Записать(РежимЗаписиДокумента.Запись);
			//		Если ОбД.Проведен Тогда
			//			ОбД.Записать(РежимЗаписиДокумента.Проведение);
			//		конецеСли;	
			//	КонецеСли;
			//Иначе
			//	
			//КонецеСли;
			
			//Д = Дост.Груз.Ссылка;
			//Если ЗначениеЗаполнено(Д) Тогда
			//	ОбД = Д.ПолучитьОбъект();
			//	Струк = Новый Структура;
			//	Струк.Вставить("Товар", тек.Номенклатура);
			//	Струк.Вставить("Стоимость", тек.Сумма);
			//	
			//	Най = ОбД.Спецификация.НайтиСтроки(Струк);
			//	Если Най.Количество() <> 0 Тогда
			//		Най_ = Най[0];
			//		Если Най_ <> Неопределено Тогда
			//			Если НАй_.Количество - Кол = 0 Тогда
			//				ОбД.Спецификация.Удалить(Най_);
			//			Иначе
			//				Най_.Количество = НАй_.Количество - Кол;
			//			КонецеСли;	
			//			
			//			ОбД.Записать(РежимЗаписиДокумента.Запись);
			//			Если ОбД.Проведен Тогда
			//				ОбД.Записать(РежимЗаписиДокумента.Проведение);
			//			конецеСли;	
			//		КонецеСли;
			//	Иначе
			//	КонецеСли;
			//КонецеСли;
		КонецЦикла;
	Иначе
		Струк = Новый Структура;
		Струк.Вставить("Доставка", Тек_.Доставка);
		НайСтр = Тек_.Документ.Товары.НайтиСтроки(Струк);
		Кол1 = 0;
		Кол2 = 0;
		
		Для Каждого Стр Из НайСтр Цикл
			Кол1 = Кол1 + Стр.Количество;
			Кол2 = Кол2 + Стр.НеобходимоеКоличество;
		КонецЦикла;	
		Если Кол1 = Кол2 Тогда
			Возврат;
		КонецеСли;	
		Дост = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Тек_.Доставка.Номер);
		Д = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(Тек_.Доставка.Номер);
		ОбД = Д.ПолучитьОбъект();
		Д2 = Документы.ПеремещениеТоваров.НайтиПоНомеру(Тек_.Доставка.Номер);
		ОбД2 = Д2.ПолучитьОбъект();
		Если Не Дост.Пустая() Тогда
			Д3 = Дост.Груз.Ссылка;
			ОбД3 = Д3.ПолучитьОбъект();
		Иначе
			Д3 = ДОКУМЕНТЫ.новаГруз.ПустаяСсылка();
		КонецеСли;	
		
		Для Каждого Тек Из НайСтр Цикл
			Кол = Тек.НеобходимоеКоличество;
			Если Кол = 0 Тогда
				Продолжить;
			КонецеСли;	
			КодТовара = Число(Тек.Номенклатура.Код);
			
			евген.ЗапросКИнтернетМагазину("DECLARE @t TMissedCount
			|INSERT INTO @t ([skuid],[MissedCount]) VALUES (" + Формат(КодТовара, "ЧГ=") + ", " + Формат(0, "ЧН=0; ЧГ=") + ")" + "
			|EXEC sp_setMissedCount " + Формат(Число(Тек.Доставка.Номер), "ЧГ=") + ", @t, 1", Соединение);
			
			//Если Тек.Сумма <> 0 Тогда
			//	Най = ОбД.Товары.Найти(Тек.Номенклатура);
			//	Если Най <> Неопределено Тогда
			//		Най.Количество = Тек.НеобходимоеКоличество;
			//		Най.Сумма = Най.Количество * Най.Цена;
			//		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Най, ОбД);
			//		
			//	Иначе
			//		Нов = ОбД.Товары.Добавить();
			//		Нов.Номенклатура = Тек.Номенклатура;
			//		Нов.ЕдиницаИзмерения = Нов.Номенклатура.ЕдиницаХраненияОстатков;
			//		Нов.Коэффициент = 1;
			//		Нов.Качество = Справочники.Качество.Новый;
			//		Нов.Количество = Тек.НеобходимоеКоличество;
			//		Если ЗначениеЗаполнено(Тек.Номенклатура) Тогда
			//			Нов.СтавкаНДС = Тек.Номенклатура.СтавкаНДС;
			//		КонецеСли;	
			//		Нов.Сумма = Тек.Сумма;
			//		Нов.Цена = Окр(Нов.Сумма/Нов.Количество, 2);
			//		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Нов, ОбД);
			//	КонецеСли;
			//	
			//Иначе
			//	Най = ОбД.ПодарочныеПозиции.Найти(Тек.Номенклатура);
			//	Если Най <> Неопределено Тогда
			//		Най.Количество = Тек.Количество;
			//		Най.Сумма = Най.Количество * Най.Цена;
			//	Иначе
			//		Нов = ОбД.ПодарочныеПозиции.Добавить();
			//		Нов.Номенклатура = Тек.Номенклатура;
			//		Нов.ЕдиницаИзмерения = Нов.Номенклатура.ЕдиницаХраненияОстатков;
			//		Нов.Коэффициент = 1;
			//		Нов.Качество = Справочники.Качество.Новый;
			//		Нов.Количество = Тек.НеобходимоеКоличество;
			//		Если ЗначениеЗаполнено(Тек.Номенклатура) Тогда
			//			Нов.СтавкаНДС = Тек.Номенклатура.СтавкаНДС;
			//		КонецеСли;	
			//		Нов.Сумма = Тек.Сумма;
			//		Нов.Сумма = Тек.Сумма;
			//		Нов.Цена = Тек.Цена;
			//		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Нов, ОбД);
			//	КонецеСли;
			//КонецеСли;
			
			
			//Струк = Новый Структура;
			//Струк.Вставить("Номенклатура", тек.Номенклатура);
			//
			//Най = ОбД2.Товары.НайтиСтроки(Струк);
			//Если Най.Количество() <> 0 Тогда
			//	Най_ = Най[0];
			//	Если Най_ <> Неопределено Тогда
			//		Най_.Количество = Тек.НеобходимоеКоличество;
			//	Иначе
			//		Нов = ОбД2.Товары.Добавить();
			//		Нов.Номенклатура = Тек.Номенклатура;
			//		Нов.ЕдиницаИзмерения = Нов.Номенклатура.ЕдиницаХраненияОстатков;
			//		Нов.Коэффициент = 1;
			//		Нов.Качество = Справочники.Качество.Новый;
			//		Нов.Количество = Тек.НеобходимоеКоличество;
			//	КонецеСли;
			//Иначе
			//	Нов = ОбД2.Товары.Добавить();
			//	Нов.Номенклатура = Тек.Номенклатура;
			//	Нов.ЕдиницаИзмерения = Нов.Номенклатура.ЕдиницаХраненияОстатков;
			//	Нов.Коэффициент = 1;
			//	Нов.Качество = Справочники.Качество.Новый;
			//	Нов.Количество = Тек.НеобходимоеКоличество;
			//КонецЕСли;
			
			
			
			//Если ЗначениеЗаполнено(д3) Тогда
			//	Струк = Новый Структура;
			//	Струк.Вставить("Товар", тек.Номенклатура);
			//	Струк.Вставить("Стоимость", тек.Сумма);
			//	
			//	Най = ОбД3.Спецификация.НайтиСтроки(Струк);
			//	Если Най.Количество() <> 0 Тогда
			//		Най_ = Най[0];
			//		Если Най_ <> Неопределено Тогда
			//			Най_.Количество = Тек.НеобходимоеКоличество;						
			//		КонецеСли;
			//	Иначе
			//		Нов = ОбД3.Спецификация.Добавить();
			//		Нов.Товар = Тек.Номенклатура;
			//		Нов.Стоимость = Тек.Сумма;
			//		Нов.Количество = Тек.НеобходимоеКоличество;
			//	КонецеСли;
			//КонецеСли;
		КонецЦикла;
		//ОбД.Записать(РежимЗаписиДокумента.Запись);
		//Если ОбД.Проведен Тогда
		//	ОбД.Записать(РежимЗаписиДокумента.Проведение);
		//конецеСли;
		//
		//lem.ОтразитьСоставЗаказаВИстории(Ссылка, ОбД.Ссылка);
		//
		//ОбД2.Записать(РежимЗаписиДокумента.Запись);
		//Если ОбД2.Проведен Тогда
		//	ОбД2.Записать(РежимЗаписиДокумента.Проведение);
		//конецеСли;
		//Если ЗначениеЗаполнено(д3) Тогда
		//ОбД3.Записать(РежимЗаписиДокумента.Запись);
		//Если ОбД3.Проведен Тогда
		//	ОбД3.Записать(РежимЗаписиДокумента.Проведение);
		//конецеСли;	
		//КонецеСли;
		
	КонецеСли;
КонецПроцедуры
